{
    "tenaska": {
        "name": "Tenaska",
        "title": "Software Developer",
        "location": "Omaha, NE",
        "date": "Fall 2024 -",
        "p1": "Working in an Agile team of 5 to develop a web-application for monitoring Tenaska's natrual gas pipelines",
        "p2": "Created multiple user-friendly UI components for the application in React.js using Scss and the MUI react library",
        "p3": "Connected front end data table to backend API to regularly pull time-sensitive data from > 40 pipelines"
    },
    "pfg": {
        "name": "Principal Financial Group",
        "title": "Software Engineering Intern",
        "location": "Des Moines, IA",
        "date": "Summer 2024",
        "p1": "Worked in an Agile team of ~15 developers developing applications to onboard and update > 75,000 active client retirement plans.",
        "p2": "Engineered the front-end interface for multiple React/Typescript/Scss web applications and gained experience in AWS lambda.",
        "p3": "Prod-deployed > 5,000 new lines of code; maintained multiple Java/Spring REST apis which connected to a SQL database."
    },
    "hudl": {
        "name": "Hudl",
        "title": "Software Development Intern - Design Studio",
        "location": "Lincoln, NE",
        "date": "Fall 2023",
        "p1": "Produced an extension of Hudl Assist specifically for field hockey, collaborating with an agile team of six.",
        "p2": "Developed and implemented logic in C# to document shot attempts and related statistics for coach and team analysis.",
        "p3": "Engineered the front-end interface for selecting multiple game events, such as shots and passes using React and TypeScript."
    },
    "raikes": {
        "name": "the Raikes School @ UNL",
        "title": "Computer Science Teaching Assistant",
        "location": "Lincoln, NE",
        "date": "Fall 2023 -",
        "p1": "Instruct > 80 Raikes Honors Computer Science students through TA hours, labs, and lectures. Review/grade assignments, tests, and labs.",
        "p2": "Expanded knowledge of: Java, SQL, OOP, Git, algorithms, data structures, discrete math, relations, the terminal, and GUIs."
    },
    "collins": {
        "name": "Collins Engineers",
        "title": "IT Intern",
        "location": "Chicago, IL",
        "date": "Summer 2023",
        "p1": "Engineered an optimized system for onboarding and offboarding all company employees utilizing Powershell and JS scripts.",
        "p2": "Customized automated HR and IT messages used in the onboarding and offboarding processes using HTML and CSS."
    },
    "unl": {
        "title": "University of Nebraska - Lincoln",
        "location": "Lincoln, NE",
        "date": "2022 - 2026",
        "p1": "Bachelor of Science, Computer Science|Minors: Business Administration, Math|GPA: 4.00/4.00",
        "p2": "The Jeffrey S. Raikes School of Computer Science and Management is a highly competitive computer science and business honors program at UNL which accepts 40 students a year.",
        "p3": "Raikes Foundation Scholar,5x Dean's List",
        "p4": "Computer Problem Solving, Software Development, Data Structures & Algorithms, Computer Systems Engineering, Unix, Software Engineering, Machine Learing 1-2, Language Concepts, Generative A.I., Operating System Principles",
        "p5": "Innovation Processes, Accounting, Economics, Finance, Leadership 1-2",
        "p6": "Calculus 1-2, Linear Algebra, Statistics & Applications, Discrete Math"
    },
    "scn": {
        "title": "Saint Charles North High School",
        "location": "Saint Charles, IL",
        "date": "Graduated May 2022",
        "p1": "SAT: 1500 (99th Percentile)|GPA: 4.34/4.00|Rank: Top 10% of Class",
        "p3": "Honors: 8x Honor Roll,AP Scholar with Distinction,2022 Senator Don Dewitte's Youth Advisory Council,Mock Trial Captain"
    },
    "pegsAndJokers": {
        "title": "Pegs & Jokers",
        "date": "Spring 2024",
        "p1": "Developed a multiplayer web browser game in React.js where users can play the board game with up to three other players.",
        "p2": "Engineered game logic to validate all player moves in Java, utilizing the Spring Boot framework with an MVC architecture.",
        "p3": "Built real-time game lobbies using Socket.IO; integrated custom user profiles with Firebase; designed an intuitive UI in CSS."
    },
    "plResource": {
        "title": "Premier League Resource",
        "date": "Fall 2023",
        "p1": "Created a full-stack web app in React/TypeScript that displays EPL soccer information such as a team’s matches and stats.",
        "p2": "Developed backend using Python, BeautifulSoup, and Flask to scrape information for >1,000 player stats and >700 matches.",
        "p3": "Designed a complete UI that resembles the English Premier League’s own style and aesthetic using SCSS.",
        "p4": "Hosted the frontend on Firebase; created a Docker container for the backend Flask app and hosted that using AWS Lightsail."
    },
    "portfolio": {
        "title": "Portfolio",
        "date": "Summer 2024",
        "p1": "The website that you are currently looking at!",
        "p2": "Developed a React.js/TypeScript application that dynamically displays my portfolio information; hosted using Firebase.",
        "p3": "Designed a variety of UI components from scratch using SCSS, as well as a mobile/portrait specific view."
    }
}